Tekla Open API Reference for Tekla Structures 2025
Solid.GetEdgeEnumerator Method
 Returns a new edge enumerator in the current plane.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public EdgeEnumerator GetEdgeEnumerator()
Public Function GetEdgeEnumerator As EdgeEnumerator
Return Value
Type: EdgeEnumerator
An edge enumerator to enumerate through the solid's global edges.
Implements
ISolid.GetEdgeEnumerator()
See Also
Reference
Solid Class
Tekla.Structures.Model Namespace